app/views/requests/_form.html.haml

    = f.label :request_type
    = f.collection_select :request_type, RequestType.all(:order => "id"), :name,:name
---
SELECT "request_types".* FROM "request_types" ORDER BY id