app/controllers/requests_controller.rb

  def index
    if current_user.has_role? :admin
    @requests =  Request.ordered
    else
    @requests =  current_user.requests.ordered
---
SELECT "requests".* FROM "requests" ORDER BY created_at desc
SELECT "requests".* FROM "requests" WHERE "requests"."user_id" = 4 ORDER BY created_at desc

  def show
    @request = Request.find(params[:id])
    if current_user.has_role? :admin
    @request.update_column(:status , "pending")
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "requests" SET "status" = 'pending' WHERE "requests"."id" = 4

  def edit
    @request = Request.find(params[:id])
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @request = Request.new(params[:request])

    respond_to do |format|
      if @request.save
---
INSERT INTO "requests" ("created_at", "details_of_request", "permission", "phone_no", "request_type", "satisfaction", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @request = Request.find(params[:id])

    respond_to do |format|
     if current_user.has_role? :admin
          if @request.update_attributes(params[:request])
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "requests" SET "status" = 'unread', "user_id" = 1, "updated_at" = '2012-12-17 06:02:30.840222' WHERE "requests"."id" = 4

  def request_info
    @requests =  Request.ordered
---
SELECT "requests".* FROM "requests" ORDER BY created_at desc